V2 event/app/controllers/events_controller.rb

SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 65], ["LIMIT", 1]]
SELECT "event_attendees".* FROM "event_attendees" WHERE "event_attendees"."event_id" = $1  [["event_id", 17]]
---
  def show
    if session[:user]
      @event = Event.find(params['id'])
      @creator = User.find(@event.creator_id)
      event_attending = EventAttendee.where(event_id: params[:id])

INSERT INTO "events" ("description", "date", "place", "created_at", "updated_at", "creator_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["description", "Un test"], ["date", "2018-05-06 00:00:00"], ["place", "Tana"], ["created_at", "2018-05-03 21:36:03.251942"], ["updated_at", "2018-05-03 21:36:03.251942"], ["creator_id", 69]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
  def create
    p params[:event][:description]
    event = Event.create(description: params[:event][:description],
      place: params[:event][:place],
      date: Date.parse(params[:event][:date]))
      event.creator = User.find(session[:user]['id'])