V2 event/app/controllers/sessions_controller.rb

  def show
    if session[:user]
      @events = Event.where(creator_id: session[:user]['id'])
---
SELECT "events".* FROM "events" WHERE "events"."creator_id" = $1  [["creator_id", 65]]

  def create
    @user = User.find_by(name: params['session']['name'].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "koto"], ["LIMIT", 1]]