V2 event/app/controllers/user_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "itokiana"], ["created_at", "2018-05-03 20:53:35.969504"], ["updated_at", "2018-05-03 20:53:35.969504"]]
---
  def create
    user = User.create(name: params[:user][:name].downcase)

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 66], ["LIMIT", 1]]
SELECT "event_attendees".* FROM "event_attendees" WHERE "event_attendees"."attendee_id" = $1  [["attendee_id", 66]]
SELECT  "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
  def show
    if params[:id]
      @user = User.find(params[:id])
      @event_attended = EventAttendee.where(attendee_id: params['id'])
      @events = []
      @event_attended.each do |e|
        @events.push(Event.find(e.event_id))